10/data/attachments/1ab1039495494fd9.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_d535f6f4-5973-4e41-a281-afdc7dc84fea</nif:username>
            <nif:friendToBeAdded>Justin_later_Friend_93536_8</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>